{
    "es": {
        "page-title": "Carlos A. Pardo — Portafolio",
        "language-label": "Lenguaje:",
        "hero-legend-tech": "Tecnologías",
        "hero-title": "Carlos A. Pardo",
        "hero-subtitle": "Científico de Datos | Analista de Datos | Desarrollo de aplicaciones con IA | Ingeniero en Telecomunicaciones",
        "nav-sobre-mi": "Sobre mí",
        "nav-proyectos": "Proyectos",
        "nav-certificaciones": "Certificaciones",
        "nav-cursos": "Cursos",
        "nav-experiencia": "Experiencia",
        "nav-educacion": "Educación",
        "nav-contacto": "Contacto",
        "section-sobre-mi-h2": "Sobre mí",
        "section-sobre-mi-p": "Data & AI Engineer especializado en la optimización de flujos de trabajo e integración de modelos predictivos para la toma de decisiones. Experto en el ciclo de vida del dato: desde la ingesta con arquitecturas Cloud (Azure) y SQL, hasta la visualización avanzada en Power BI. Con una sólida base en ingeniería, combino la automatización con Python y la contenerización (Docker) para escalar soluciones de Inteligencia Artificial.",
        "section-proyectos-h2": "Proyectos",
        "proyecto-1-h3": "Analista de Datos - Análisis de Talento Humano",
        "proyecto-1-p": "Análisis orientado al área de Talento Humano para identificar patrones de deserción, evaluando factores como antigüedad, satisfacción laboral, desempeño y otras variables internas.",
        "proyecto-2-h3": "Dashboard Power BI - Ingresos en Veterinaria",
        "proyecto-2-p": "Reporte sobre ingresos según tratamientos, esterilización y servicios. Permite visualizar cómo afectan estos factores al rendimiento económico.",
        "proyecto-3-h3": "Proyecto de IA - Compañero programador local (LLM)",
        "proyecto-3-p": "LLM local optimizada para programación. Utilizada como herramienta clave en IEEE Xtreme 19.0, mostrando su utilidad bajo presión de tiempo.",
        "proyecto-4-h3": "Proyecto de IA - IA generadora de gatitos",
        "proyecto-4-p": "Proyecto basado en ProGAN. Entrenamiento desde cero explorando arquitectura generativa. Resultados prometedores limitados por hardware.",
        "proyecto-5-h3": "Participación en IEEEXtreme 19.0",
        "proyecto-5-p": "Resolución de todos los problemas de la competencia IEEEXtreme 19.0 (24 horas). Uso de Python, C y C++. Competencia usualmente en equipos de 3, realizada de forma individual.",
        "proyecto-6-h3": "Ciencia de Datos - Predicción de Sobrevivientes del Titanic",
        "proyecto-6-p": "Proyecto de ciencia de datos enfocado en construir varios modelos avanzados capaces de predecir la probabilidad de supervivencia de los pasajeros del Titanic. Incluye un pipeline completo: análisis exploratorio, limpieza de datos, ingeniería de características y modelado con XGBoost, logrando un rendimiento altamente estable mediante validación cruzada (RMSE ≈ 0.056). La imagen a continuación muestra el top mejores modelos encontrados para este problema y las características más relevantes para sobrevivir. Aquí descata el título con casi un 60% de influencia en si una persona hubiera sobrevivido o no.",
        "proyecto-7-h3": "Ciencia de Datos - Predicción de Accidentes",
        "proyecto-7-p": "Desarrollé un modelo predictivo para anticipar accidentes analizando factores humanos, ambientales y operativos. El sistema no solo identifica patrones de riesgo ocultos, sino que permite priorizar alertas y optimizar recursos preventivos de forma inteligente. Implementé XGBoost para lograr una alta precisión, asegurando mediante un análisis de residuos que el modelo es robusto, sin sesgos y confiable para la toma de decisiones críticas en seguridad.",
        "proyecto-7-p-2": "A continuación, se presentan dos imágenes representativas del proyecto: la primera muestra una comparación de los modelos predictivos utilizados, destacando su rendimiento y precisión en la predicción de accidentes. La segunda imagen ilustra los factores más influyentes que contribuyen a la ocurrencia de accidentes, proporcionando insights clave para la prevención y mitigación de riesgos. El Análisis de Residuos asegura que el modelo es robusto. La distribución normal y centrada en cero de los errores descarta sesgos sistemáticos (ej. subestimación de riesgo), siendo vital para la toma de decisiones críticas.",
        "link-ver-codigo": "💻 Explorar el proyecto completo",
        "section-certificaciones-h2": "Certificaciones",
        "cert-ai-legend": "Datos e Inteligencia Artificial",
        "cert-ai-1": "AI Engineer for Developers Associate",
        "cert-ai-2": "AI Engineer for Data Scientists Associate",
        "cert-ai-3": "Data Scientist Associate",
        "cert-ai-4": "Data Engineer Associate",
        "cert-ai-5": "Data Analyst in Power BI",
        "cert-ai-6": "MongoDB for Developers",
        "cert-net-legend": "Redes y Ciberseguridad",
        "cert-net-1": "Junior Cybersecurity Analyst",
        "cert-net-2": "Network Technician",
        "cert-fund-legend": "Fundamentos y operaciones",
        "cert-fund-1": "GitHub Foundations",
        "cert-fund-2": "Riesgos Laborales (solo Ecuador)",
        "cert-web-legend": "Desarrollo Web",
        "cert-web-1": "Diseño Web Responsivo",
        "section-cursos-h2": "Cursos",
        "curso-1": "Containerization and Virtualization with Docker and Kubernetes",
        "curso-2": "Reports in Power BI",
        "curso-3": "Microsoft Azure Fundamentals",
        "curso-4": "Developing LLM Applications with LangChain",
        "section-experiencia-h2": "Experiencia",
        "exp-1-legend": "Ingeniero de Datos / Analista Autónomo",
        "exp-1-duracion": "2 años",
        "exp-1-p": "Diseño y automatización de pipelines ETL/ELT utilizando Python y SQL. Desarrollo de arquitecturas de datos para transformar flujos complejos en modelos analíticos y dashboards de alto impacto en Power BI, optimizando la toma de decisiones basada en datos.",
        "exp-2-legend": "Ingeniero de Redes - ISP",
        "exp-2-duracion": "2 años",
        "exp-2-p": "Administración de infraestructura crítica de red y routing avanzado (BGP, OSPF). Implementación de sistemas de monitoreo de tráfico y optimización de topologías de fibra óptica para garantizar alta disponibilidad y mínima latencia en servicios de gran escala.",
        "exp-3-legend": "Especialista IT e Infraestructura",
        "exp-3-duracion": "1 año",
        "exp-3-p": "Gestión de administración de sistemas, seguridad de la información y virtualización. Automatización de procesos de soporte y despliegue de políticas de seguridad corporativa, asegurando la continuidad operativa y la integridad de los activos tecnológicos.",
        "educacion-h2": "Educación y Habilidades Lingüísticas",
        "edu-legend-academica": "Formación Académica",
        "edu-titulo": "Ingeniero en Telecomunicaciones",
        "edu-universidad": "Universidad de Cuenca",
        "edu-promocion": "Promoción: 2025",
        "edu-legend-idiomas": "Idiomas",
        "idioma-espanol-nombre": "Español:",
        "idioma-espanol-nivel": "Nativo",
        "idioma-ingles-nombre": "Inglés:",
        "idioma-ingles-nivel": "B1 Intermedio",
        "page-title-proyectos": "Carlos A. Pardo — Todos los Proyectos",
        "ver-todos-proyectos": "Ver todos los proyectos →",
        "volver-inicio": "← Volver al inicio",
        "footer-h2": "Contacto",
        "contacto-whatsapp-nombre": "WhatsApp",
        "contacto-correo-nombre": "Correo",
        "contacto-linkedin-nombre": "LinkedIn",
        "contacto-linkedin-detalle": "Perfil Profesional",
        "contacto-github-nombre": "GitHub",
        "contacto-github-detalle": "Repositorios",
        "footer-copyright": "© 2025 Carlos A. Pardo",
        "proyecto-8-h3": "Ingeniería de Datos - De extremo a extremo, desde Azure local hasta Insights",
        "proyecto-8-p": "Implementación de un pipeline de Ingeniería de Datos completo (End-to-End) para migrar datos on-premises a Azure. Se utiliza Azure Data Factory para la orquestación, Azure Databricks para la transformación a gran escala, y Azure Synapse como capa analítica. El proyecto asegura el conjunto de datos de Oportunidades de Venta (CRM) y lo convierte en insights de negocio clave, visualizados en un informe de Power BI. Además se utiliza Logic Apps para la gestión de alertas con envío de correos para eventos.",
        "proyecto-9-h3": "Ingeniería de Datos - De extremo a extremo, desde Azure local hasta Insights",
        "proyecto-9-p": "Implementación de un pipeline de Ingeniería de Datos completo (End-to-End) para migrar datos on-premises a Azure. Se utiliza Azure Data Factory para la orquestación, Azure Databricks para la transformación a gran escala, y Azure Synapse como capa analítica. El proyecto asegura el conjunto de datos de Oportunidades de Venta (CRM) y lo convierte en insights de negocio clave, visualizados en un informe de Power BI. Además se utiliza Logic Apps para la gestión de alertas con envío de correos para eventos.",
        "filter-label": "Especialidad:",
        "filter-all": "Todos los proyectos",
        "filter-sci": "Ciencia de Datos",
        "filter-ana": "Análisis de Datos",
        "filter-eng": "Ingeniería de Datos",
        "proyecto-10-h3": "Netflix: Ingeniería y Análisis de Datos Usando SQL (SSMS)",
        "proyecto-10-p": "En este proyecto tomé un dataset de Netflix que venía con varios detalles: títulos con caracteres mal leídos, registros duplicados y mucha información mezclada en una sola columna. Usé SQL para limpiar todo, ajustando los tipos de datos y separando la información en tablas organizadas (Géneros, Directores, Países) para que fuera fácil de consultar. Una vez que los datos quedaron ordenados, respondí preguntas clave sobre el contenido, como quiénes son los directores más activos y qué países lideran en géneros específicos. Es un ejemplo práctico de cómo pasar de un archivo de texto desordenado a una base de datos lista para el análisis.",
        "proyecto-11-h3": "SkyWatch ETL: Arquitectura de Datos Meteorológicos en Azure",
        "proyecto-11-p": "Desarrollo de un pipeline ETL automatizado que integra la API de Open-Meteo con PostgreSQL en Azure. Utilizando Apache Airflow (Astro) y Docker, el sistema extrae métricas climáticas en tiempo real para Cuenca, Ecuador, aplica transformaciones lógicas para la detección de alertas climáticas y garantiza la persistencia de datos en una infraestructura de nube escalable."
    },
    "en": {
        "page-title": "Carlos A. Pardo — Portfolio",
        "language-label": "Language:",
        "hero-legend-tech": "Technologies",
        "hero-title": "Carlos A. Pardo",
        "hero-subtitle": "Data Scientist | Data Analyst | AI Application Developer | Telecommunications Engineer",
        "nav-sobre-mi": "About Me",
        "nav-proyectos": "Projects",
        "nav-certificaciones": "Certifications",
        "nav-cursos": "Courses",
        "nav-experiencia": "Experience",
        "nav-educacion": "Education",
        "nav-contacto": "Contact",
        "section-sobre-mi-h2": "About Me",
        "section-sobre-mi-p": "Data & AI Engineer specialized in workflow optimization and the integration of predictive models for decision-making. Expert in the data lifecycle: from ingestion using Cloud architectures (Azure) and SQL, to advanced visualization in Power BI. With a strong engineering background, I combine Python automation and containerization (Docker) to scale Artificial Intelligence solutions.",
        "section-proyectos-h2": "Projects",
        "proyecto-1-h3": "Data Analyst - Human Talent Analysis",
        "proyecto-1-p": "Analysis focused on the Human Talent area to identify patterns of turnover, evaluating factors such as tenure, job satisfaction, performance, and other internal variables.",
        "proyecto-2-h3": "Power BI Dashboard - Veterinary Income",
        "proyecto-2-p": "Report focusing on income based on treatments, sterilization status, and services. Allows visualizing how these factors affect economic performance.",
        "proyecto-3-h3": "AI Project - Local Programmer Companion (LLM)",
        "proyecto-3-p": "Local LLM optimized for programming tasks. Used as a key assistant in the IEEE Xtreme 19.0 competition, demonstrating utility under time pressure.",
        "proyecto-4-h3": "AI Project - Kitten Generator AI",
        "proyecto-4-p": "ProGAN-based project. Training from scratch exploring generative architecture. Promising initial results limited by high hardware demand.",
        "proyecto-5-h3": "Participation in IEEEXtreme 19.0",
        "proyecto-5-p": "Resolution of all problems from the 24-hour IEEEXtreme 19.0 competition. Used Python, C, and C++. Competition usually done in teams of 3, completed individually.",
        "proyecto-6-h3": "Data Science - Titanic Survivors Prediction",
        "proyecto-6-p": "Data Science project focused on building several advanced models capable of predicting the survival probability of Titanic passengers. It includes a complete pipeline: exploratory analysis, data cleaning, feature engineering, and modeling with XGBoost, achieving highly stable performance through cross-validation (RMSE ≈ 0.056). The image below shows the top performing models found for this problem and the most relevant survival features. Here, the passenger title stands out with almost 60% influence on whether a person would have survived or not.",
        "proyecto-7-h3": "Data Science - Accident Risk Prediction",
        "proyecto-7-p": "Developed a predictive system to anticipate accidents by analyzing human, environmental, and operational factors. The model identifies hidden risk patterns, enabling smart resource optimization and proactive safety alerts. By implementing XGBoost and rigorous residual analysis, I ensured a high-accuracy, unbiased model that provides reliable insights for critical safety decision-making.",
        "proyecto-7-p-2": "Below are two representative images of the project: the first shows a comparison of the predictive models used, highlighting their performance and precision in accident prediction. The second image illustrates the most influential factors contributing to accident occurrence, providing key insights for prevention and risk mitigation. Residual Analysis ensures the model is robust. The normal, zero-centered error distribution rules out systematic biases (e.g., risk underestimation), which is vital for critical decision-making.",
        "link-ver-codigo": "💻 Explore the complete project",
        "section-certificaciones-h2": "Certifications",
        "cert-ai-1": "AI Engineer for Developers Associate",
        "cert-ai-2": "AI Engineer for Data Scientists Associate",
        "cert-ai-3": "Data Scientist Associate",
        "cert-ai-4": "Data Engineer Associate",
        "cert-ai-5": "Data Analyst in Power BI",
        "cert-ai-6": "MongoDB for Developers",
        "cert-net-legend": "Networking and Cybersecurity",
        "cert-net-1": "Junior Cybersecurity Analyst",
        "cert-net-2": "Network Technician",
        "cert-fund-legend": "Foundations and Operations",
        "cert-fund-1": "GitHub Foundations",
        "cert-fund-2": "Occupational Hazards (Ecuador only)",
        "cert-web-legend": "Web Development",
        "cert-web-1": "Responsive Web Design",
        "section-cursos-h2": "Courses",
        "curso-1": "Containerization and Virtualization with Docker and Kubernetes",
        "curso-2": "Reports in Power BI",
        "curso-3": "Microsoft Azure Fundamentals",
        "curso-4": "Developing LLM Applications with LangChain",
        "section-experiencia-h2": "Experience",
        "exp-1-legend": "Freelance Data Engineer / Analyst",
        "exp-1-duracion": "2 years",
        "exp-1-p": "Designing and automating ETL/ELT pipelines using Python and SQL. Developing data architectures to transform complex data streams into analytical models and high-impact Power BI dashboards, optimizing data-driven decision-making processes.",
        "exp-2-legend": "Network Engineer - ISP",
        "exp-2-duracion": "2 years",
        "exp-2-p": "Managing critical network infrastructure and advanced routing (BGP, OSPF). Implementing traffic monitoring systems and optimizing fiber optic topologies to ensure high availability and ultra-low latency for large-scale service delivery.",
        "exp-3-legend": "IT & Infrastructure Specialist",
        "exp-3-duracion": "1 year",
        "exp-3-p": "System administration, information security, and virtualization management. Automating support workflows and deploying corporate security policies, ensuring operational continuity and the integrity of technological assets.",
        "educacion-h2": "Education and Language Skills",
        "edu-legend-academica": "Academic Background",
        "edu-titulo": "Telecommunications Engineer",
        "edu-universidad": "University of Cuenca",
        "edu-promocion": "Graduation: 2025",
        "edu-legend-idiomas": "Languages",
        "idioma-espanol-nombre": "Spanish:",
        "idioma-espanol-nivel": "Native",
        "idioma-ingles-nombre": "English:",
        "idioma-ingles-nivel": "B1 Intermediate",
        "page-title-proyectos": "Carlos A. Pardo — All Projects",
        "ver-todos-proyectos": "View all projects →",
        "volver-inicio": "← Back to home",
        "footer-h2": "Contact",
        "contacto-whatsapp-nombre": "WhatsApp",
        "contacto-correo-nombre": "Email",
        "contacto-linkedin-nombre": "LinkedIn",
        "contacto-linkedin-detalle": "Professional Profile",
        "contacto-github-nombre": "GitHub",
        "contacto-github-detalle": "Repositories",
        "footer-copyright": "© 2025 Carlos A. Pardo",
        "proyecto-8-h3": "Data Engineering - End-to-End Azure On-Premise to Insights",
        "proyecto-8-p": "Implementation of a complete End-to-End Data Engineering pipeline to migrate data from on-premises to Azure. The solution leverages Azure Data Factory for orchestration, Azure Databricks for large-scale transformation, and Azure Synapse as the analytical layer. The project secures the CRM Sales Opportunities dataset and converts it into key business insights, visualized in a Power BI report. Additionally, Logic Apps are used for alert management and email notifications for pipeline events.",
        "proyecto-9-h3": "Data Engineering - End-to-End Azure On-Premise to Insights",
        "proyecto-9-p": "Implementation of a complete End-to-End Data Engineering pipeline to migrate data from on-premises to Azure. The solution leverages Azure Data Factory for orchestration, Azure Databricks for large-scale transformation, and Azure Synapse as the analytical layer. The project secures the CRM Sales Opportunities dataset and converts it into key business insights, visualized in a Power BI report. Additionally, Logic Apps are used for alert management and email notifications for pipeline events.",
        "filter-label": "Specialty:",
        "filter-all": "All Projects",
        "filter-sci": "Data Science",
        "filter-ana": "Data Analysis",
        "filter-eng": "Data Engineering",
        "proyecto-10-h3": "Netflix: Data Engineering and Analysis Using SQL (SSMS)",
        "proyecto-10-p": "In this project I worked with a Netflix dataset that arrived with several issues: messy text encoding, duplicate entries, and multiple values crammed into single columns. I used SQL to clean it up, optimizing data types and normalizing the structure into separate tables for Genres, Directors, and Countries. Once the data was structured, I performed an analysis to answer key questions, such as identifying the most productive directors by year and calculating average movie durations. It’s a practical demonstration of transforming a raw file into a reliable database for business analysis.",
        "proyecto-11-h3": "SkyWatch ETL: Weather Data Architecture on Azure",
        "proyecto-11-p": "Development of an automated ETL pipeline integrating the Open-Meteo API with Azure Database for PostgreSQL. Leveraging Apache Airflow (Astro) and Docker, the system extracts real-time weather metrics for Cuenca, Ecuador, applies logical transformations for weather alert detection, and ensures data persistence within a scalable cloud infrastructure."
    }
}