{
    "es": {
        "page-title": "Carlos A. Pardo — Portafolio",
		"language-label": "Lenguaje:",
        "hero-legend-tech": "Tecnologías",
        "hero-title": "Carlos A. Pardo",
        "hero-subtitle": "Científico de Datos | Analista de Datos | Desarrollo de aplicaciones con IA | Ingeniero en Telecomunicaciones",
        "nav-sobre-mi": "Sobre mí",
        "nav-proyectos": "Proyectos",
        "nav-certificaciones": "Certificaciones",
        "nav-cursos": "Cursos",
        "nav-experiencia": "Experiencia",
        "nav-educacion": "Educación",
        "nav-contacto": "Contacto",
        
        "section-sobre-mi-h2": "Sobre mí",
        "section-sobre-mi-p": "Ingeniero en Telecomunicaciones con experiencia en operaciones de ISP, Automatización, Ciencia y Análisis de Datos. Enfocado en la optimización de flujos de trabajo e integración de Inteligencia Artificial para la toma de decisiones. Dominio en el desarrollo de scripts con Python, manejo de bases de datos (SQL/NoSQL) y visualización de datos con Power BI. Experiencia en infraestructura de red y contenerización (Docker).",
        
        "section-proyectos-h2": "Proyectos",
        "proyecto-1-h3": "Dashboard Power BI - Análisis de Talento Humano",
        "proyecto-1-p": "Análisis orientado al área de Talento Humano para identificar patrones de deserción, evaluando factores como antigüedad, satisfacción laboral, desempeño y otras variables internas.",
        "proyecto-2-h3": "Dashboard Power BI - Ingresos en Veterinaria",
        "proyecto-2-p": "Reporte sobre ingresos según tratamientos, esterilización y servicios. Permite visualizar cómo afectan estos factores al rendimiento económico.",
        "proyecto-3-h3": "Proyecto de IA - Compañero programador local (LLM)",
        "proyecto-3-p": "LLM local optimizada para programación. Utilizada como herramienta clave en IEEE Xtreme 19.0, mostrando su utilidad bajo presión de tiempo.",
        "proyecto-4-h3": "Proyecto de IA - IA generadora de gatitos",
        "proyecto-4-p": "Proyecto basado en ProGAN. Entrenamiento desde cero explorando arquitectura generativa. Resultados prometedores limitados por hardware.",
        "proyecto-5-h3": "Participación en IEEEXtreme 19.0",
        "proyecto-5-p": "Resolución de todos los problemas de la competencia IEEEXtreme 19.0 (24 horas). Uso de Python, C y C++. Competencia usualmente en equipos de 3, realizada de forma individual.",
		"proyecto-6-h3": "Ciencia de Datos - Predicción de Sobrevivientes del Titanic",
  "proyecto-6-p": "Proyecto de ciencia de datos enfocado en construir varios modelos avanzados capaces de predecir la probabilidad de supervivencia de los pasajeros del Titanic. Incluye un pipeline completo: análisis exploratorio, limpieza de datos, ingeniería de características y modelado con XGBoost, logrando un rendimiento altamente estable mediante validación cruzada (RMSE ≈ 0.056). La imagen a continuación muestra el top mejores modelos encontrados para este problema y las características más relevantes para sobrevivir. Aquí descata el título con casi un 60% de influencia en si una persona hubiera sobrevivido o no.",
  
  "proyecto-7-h3": "Ciencia de Datos - Predicción de Accidentes",
  "proyecto-7-p": "Proyecto orientado a identificar patrones de riesgo y predecir la probabilidad de accidentes utilizando técnicas avanzadas de ciencia de datos y machine learning. El trabajo incluye limpieza y normalización de datos, análisis exploratorio profundo, ingeniería de características basada en factores humanos, ambientales y operativos, y construcción de modelos predictivos capaces de anticipar incidentes con alta precisión. El objetivo principal es apoyar la toma de decisiones preventivas mediante modelos que permiten priorizar alertas, optimizar recursos de seguridad y reducir eventos críticos. Este proyecto demuestra mi capacidad para transformar datos complejos en información accionable y desarrollar soluciones que aportan valor real en contextos de seguridad y prevención de riesgos.",
  "proyecto-7-p-2": "A continuación, se presentan dos imágenes representativas del proyecto: la primera muestra una comparación de los modelos predictivos utilizados, destacando su rendimiento y precisión en la predicción de accidentes. La segunda imagen ilustra los factores más influyentes que contribuyen a la ocurrencia de accidentes, proporcionando insights clave para la prevención y mitigación de riesgos. El Análisis de Residuos asegura que el modelo es robusto. La distribución normal y centrada en cero de los errores descarta sesgos sistemáticos (ej. subestimación de riesgo), siendo vital para la toma de decisiones críticas.",
        "link-ver-codigo": "💻 Ver el Código y Detalles en GitHub",

        "section-certificaciones-h2": "Certificaciones",
        "cert-ai-legend": "Datos e Inteligencia Artificial",
        "cert-ai-1": "AI Engineer for Developers",
        "cert-ai-2": "AI Engineer for Data Scientists",
        "cert-ai-3": "MongoDB for Developers",
        "cert-ai-4": "Data Analyst in Power BI",
        "cert-net-legend": "Redes y Ciberseguridad",
        "cert-net-1": "Junior Cybersecurity Analyst",
        "cert-net-2": "Network Technician",
        "cert-fund-legend": "Fundamentos y operaciones",
        "cert-fund-1": "GitHub Foundations",
        "cert-fund-2": "Riesgos Laborales (solo Ecuador)",
        
        "section-cursos-h2": "Cursos",
        "curso-1": "Containerization and Virtualization with Docker and Kubernetes",
        "curso-2": "Reports in Power BI",
        "curso-3": "Microsoft Azure Fundamentals",
        "curso-4": "Developing LLM Applications with LangChain",

        "section-experiencia-h2": "Experiencia",
        "exp-1-legend": "Autónomo - Analista y Científico de Datos",
        "exp-1-duracion": "2 años",
        "exp-1-p": "Desarrollo de soluciones de BI y Data Analytics usando Python, SQL y Power BI. Transformación de datos en insights accionables.",
        "exp-2-legend": "Ingeniero de Redes - Proveedor de Servicios de Internet",
        "exp-2-duracion": "2 años",
        "exp-2-p": "Gestión de infraestructura de red (routers, switches, fibra óptica) asegurando disponibilidad y baja latencia.",
        "exp-3-legend": "Especialista IT - Área Empresarial",
        "exp-3-duracion": "1 año",
        "exp-3-p": "Soporte técnico, administración de sistemas, gestión de incidentes y políticas de seguridad.",
        
        "educacion-h2": "Educación y Habilidades Lingüísticas",
        "edu-legend-academica": "Formación Académica",
        "edu-titulo": "Ingeniero en Telecomunicaciones",
        "edu-universidad": "Universidad de Cuenca",
        "edu-promocion": "Promoción: 2025",
        "edu-legend-idiomas": "Idiomas",
        "idioma-espanol-nombre": "Español:",
        "idioma-espanol-nivel": "Nativo",
        "idioma-ingles-nombre": "Inglés:",
        "idioma-ingles-nivel": "B1 Intermedio",

        "footer-h2": "Contacto",
        "contacto-whatsapp-nombre": "WhatsApp",
        "contacto-correo-nombre": "Correo",
        "contacto-linkedin-nombre": "LinkedIn",
        "contacto-linkedin-detalle": "Perfil Profesional",
        "contacto-github-nombre": "GitHub",
        "contacto-github-detalle": "Repositorios",
        "footer-copyright": "© 2025 Carlos A. Pardo"
    },
    "en": {
        "page-title": "Carlos A. Pardo — Portfolio",
		"language-label": "Language:",
        "hero-legend-tech": "Technologies",
        "hero-title": "Carlos A. Pardo",
        "hero-subtitle": "Data Scientist | Data Analyst | AI Application Developer | Telecommunications Engineer",
        "nav-sobre-mi": "About Me",
        "nav-proyectos": "Projects",
        "nav-certificaciones": "Certifications",
        "nav-cursos": "Courses",
        "nav-experiencia": "Experience",
        "nav-educacion": "Education",
        "nav-contacto": "Contact",
        
        "section-sobre-mi-h2": "About Me",
        "section-sobre-mi-p": "Telecommunications Engineer with experience in ISP operations, Automation, Data Science and Analysis. Focused on optimizing workflows and integrating Artificial Intelligence for decision making. Proficient in Python scripting, database management (SQL/NoSQL), and data visualization with Power BI. Experience in network infrastructure and containerization (Docker).",
        
        "section-proyectos-h2": "Projects",
        "proyecto-1-h3": "Power BI Dashboard - Human Talent Analysis",
        "proyecto-1-p": "Analysis focused on the Human Talent area to identify patterns of turnover, evaluating factors such as tenure, job satisfaction, performance, and other internal variables.",
        "proyecto-2-h3": "Power BI Dashboard - Veterinary Income",
        "proyecto-2-p": "Report focusing on income based on treatments, sterilization status, and services. Allows visualizing how these factors affect economic performance.",
        "proyecto-3-h3": "AI Project - Local Programmer Companion (LLM)",
        "proyecto-3-p": "Local LLM optimized for programming tasks. Used as a key assistant in the IEEE Xtreme 19.0 competition, demonstrating utility under time pressure.",
        "proyecto-4-h3": "AI Project - Kitten Generator AI",
        "proyecto-4-p": "ProGAN-based project. Training from scratch exploring generative architecture. Promising initial results limited by high hardware demand.",
        "proyecto-5-h3": "Participation in IEEEXtreme 19.0",
        "proyecto-5-p": "Resolution of all problems from the 24-hour IEEEXtreme 19.0 competition. Used Python, C, and C++. Competition usually done in teams of 3, completed individually.",
		"proyecto-6-h3": "Data Science - Titanic Survivors Prediction",
		"proyecto-6-p": "Data Science project focused on building several advanced models capable of predicting the survival probability of Titanic passengers. It includes a complete pipeline: exploratory analysis, data cleaning, feature engineering, and modeling with XGBoost, achieving highly stable performance through cross-validation (RMSE ≈ 0.056). The image below shows the top performing models found for this problem and the most relevant survival features. Here, the passenger title stands out with almost 60% influence on whether a person would have survived or not.",
		"proyecto-7-h3": "Data Science - Accident Risk Prediction",
  "proyecto-7-p": "Project aimed at identifying risk patterns and predicting the probability of accidents using advanced data science and machine learning techniques. The work includes data cleaning and normalization, deep exploratory analysis, feature engineering based on human, environmental, and operational factors, and the construction of predictive models capable of anticipating incidents with high precision. The main objective is to support preventive decision-making through models that allow prioritizing alerts, optimizing security resources, and reducing critical events. This project demonstrates my ability to transform complex data into actionable information and develop solutions that provide real value in security and risk prevention contexts.",
  "proyecto-7-p-2": "Below are two representative images of the project: the first shows a comparison of the predictive models used, highlighting their performance and precision in accident prediction. The second image illustrates the most influential factors contributing to accident occurrence, providing key insights for prevention and risk mitigation. **Residual Analysis** ensures the model is robust. The normal, zero-centered error distribution rules out systematic biases (e.g., risk underestimation), which is vital for critical decision-making.",
        "link-ver-codigo": "💻 View Code and Details on GitHub",

        "section-certificaciones-h2": "Certifications",
        "cert-ai-legend": "Data and Artificial Intelligence",
        "cert-ai-1": "AI Engineer for Developers",
        "cert-ai-2": "AI Engineer for Data Scientists",
        "cert-ai-3": "MongoDB for Developers",
        "cert-ai-4": "Data Analyst in Power BI",
        "cert-net-legend": "Networking and Cybersecurity",
        "cert-net-1": "Junior Cybersecurity Analyst",
        "cert-net-2": "Network Technician",
        "cert-fund-legend": "Foundations and Operations",
        "cert-fund-1": "GitHub Foundations",
        "cert-fund-2": "Occupational Hazards (Ecuador only)",
        
        "section-cursos-h2": "Courses",
        "curso-1": "Containerization and Virtualization with Docker and Kubernetes",
        "curso-2": "Reports in Power BI",
        "curso-3": "Microsoft Azure Fundamentals",
        "curso-4": "Developing LLM Applications with LangChain",

        "section-experiencia-h2": "Experience",
        "exp-1-legend": "Freelance - Data Analyst and Scientist",
        "exp-1-duracion": "2 years",
        "exp-1-p": "Development of BI and Data Analytics solutions using Python, SQL, and Power BI. Transforming raw data into actionable insights.",
        "exp-2-legend": "Network Engineer - Internet Service Provider",
        "exp-2-duracion": "2 years",
        "exp-2-p": "Management of network infrastructure (routers, switches, fiber optics) ensuring high availability and low latency.",
        "exp-3-legend": "IT Specialist - Corporate Area",
        "exp-3-duracion": "1 year",
        "exp-3-p": "Technical support, systems administration, incident management, and security policies implementation.",
        
        "educacion-h2": "Education and Language Skills",
        "edu-legend-academica": "Academic Background",
        "edu-titulo": "Telecommunications Engineer",
        "edu-universidad": "University of Cuenca",
        "edu-promocion": "Graduation: 2025",
        "edu-legend-idiomas": "Languages",
        "idioma-espanol-nombre": "Spanish:",
        "idioma-espanol-nivel": "Native",
        "idioma-ingles-nombre": "English:",
        "idioma-ingles-nivel": "B1 Intermediate",

        "footer-h2": "Contact",
        "contacto-whatsapp-nombre": "WhatsApp",
        "contacto-correo-nombre": "Email",
        "contacto-linkedin-nombre": "LinkedIn",
        "contacto-linkedin-detalle": "Professional Profile",
        "contacto-github-nombre": "GitHub",
        "contacto-github-detalle": "Repositories",
        "footer-copyright": "© 2025 Carlos A. Pardo"
    }
}